<style scoped>
    @import "../assets/css/customer.css";
</style>

// h1 d-none 
// banner 用掉 h2

<template>
    <h1 class="d-none">Title</h1>
    <Header />
    <main>
        <!-- section 1 -->
        <section class="banner">
            <div class="banner-image"></div>
            <div class="banner-content">
                <h2>
                    <span>隱私權保護聲明</span><br>
                    <span>About</span>
                </h2>
            </div>
        </section>
        <!-- section 2 -->
        <section>
            <h3>最新消息</h3>
        </section>
        <!-- section 3 -->
        <section>
            <div class="customer">
                <h4>適用範圍</h4>
                <p>
                    本聲明，適用於您透過悠遊卡股份有限公司(以下簡稱本公司)網站提供之產品及服務，包括本公司網站（Domain Name，即easycard.com.tw，以下簡稱本網站）提供之各項服務、本公司提供之行動應用程式悠遊卡Easy Wallet App（以下簡稱本服務），以及提供申請本公司提供記名、客服等各項服務（以下簡稱其他服務），所涉及的個人資料蒐集、處理、利用與保護。但本聲明不適用於本服務、本網站或其他服務以外的外部網頁連結。
                    <br>
                    個人資料之蒐集、處理及利用方式
                    當您使用本服務、本網站或其他服務時，本公司會在經您同意本公司個人資料蒐集、處理及利用之告知事項後，基於合法、正當合理的特定目的，在確實必要的範圍內請您提供姓名、身分證明文件資料、國籍、出生年月日、住址、電子郵件地址、電話、位置資訊、匯款帳號或其他相關必要個人資料。此外，本網站亦會保留您在上網瀏覽或查詢時，伺服器自行產生的相關紀錄，包括但不限於您使用連線設備的IP位址、使用時間、瀏覽器資訊及點選紀錄等。
                    本服務中，悠遊卡Easy Wallet App係透過行動裝置應用程式請您於註冊時提供上開必要之個人資料，以作為身分識別、帳務處理、顧客聯繫、統計分析等用途，且將隨時依應用程式功能所需詢問您是否開放權限，以取得行動裝置應用程式之授權。
                    本公司網站提供連結的其他網站，並非由本公司管理，當您在這些網頁進行活動時，關於個人資料的蒐集、運用與保護，適用各該網站的隱私權政策。
                    <br>
                    個人資料之保護
                    本服務、本網站或其他服務主機均設有防火牆、各項資訊安全設備及必要的安全防護措施加以保護網站，只由經過授權的管理人員才能接觸相關瀏覽紀錄，相關人員於合約內皆有保密條款，如有違反保密義務者，將會受到相關的法律處分。
                    1.本公司將確保個人資料的正確性，並於必要時進行更新，已蒐集的個人資料將會依法或在合法、正當合理的特定目的下保存。
                    2.對於本公司透過本網站、本服務或其他服務所蒐集、處理與利用您的個人資料，除法令另有規定外，您可以：（1）查詢或請求閱覽您的個人資料。（2）請求製給您個人資料之複製本。（3）請求補充或更正您的個人資料。（4）請求停止蒐集、利用或處理您的個人資料；或（5）請求刪除您的個人資料。
                    您得隨時向本公司提出上述申請，本公司將依個人資料保護法及法令遵循或內部控制等相關法令規範，據以決定或受理您的申請。
                    3.只有在確實已有適當充分保護的狀況下，本公司才會將個人資料進行國際傳輸。
                    <br>
                    Cookie的運用與政策
                    Cookie是伺服端為了區別使用者的不同喜好，經由瀏覽器寫入使用者硬碟的一些簡短資訊。使用者可在瀏覽器設定中修改對Cookie的接受程度，若選擇拒絕所有的Cookie，可能無法使用部份個人化服務，或是參與部份的活動。
                    當您瀏覽本網站、使用本公司服務或其他服務時，凡未經您主動提供所產生的資料，例如使用者連線設備的IP位址、設備資訊、使用時間、使用的瀏覽器、瀏覽及點選紀錄等資料，僅會在對本網站、本服務或其他服務全體使用者整體行為進行統計分析之特定目的必要範圍內利用及處理，並不會對個別使用者進行分析。
                    <br>
                    個人資料提供予第三者
                    本公司所蒐集的個人資料，在本公司所提供的本網站、本服務或其他服務業務範圍內或依法得為交互運用之規範下進行，除法律另有規定外，不會將其做為超出蒐集之特定目的以外之利用。除非在蒐集時有向您告知並徵得您的同意，或法令另有規定外，否則本公司所蒐集的個人資料，將不會與他人共同使用、亦不會使用在未告知您的用途上。
                    <br>
                    個人資料之安全與保護
                    本網站、本服務或其他服務係採用完善之科技保障您的個人資訊安全，只由經過授權的管理人員才能接觸相關瀏覽紀錄。提醒您應妥善保管帳號密碼，在使用完本網站、本服務或其他服務後，請務必記得登出帳戶，若使用公共電腦，切記要關閉瀏覽器視窗，以防止他人讀取您的資訊或信件。
                    本公司對您的資訊將妥為保護，並避免遺失或未經授權之使用、銷毀、修改、再處理或公開，若無保存必要時，將確實銷毀。
                    本網站、本服務或其他服務提供其他網站的網路連結，該連結網站不適用本聲明，您必須參考該連結網站中的隱私權保護政策。
                    <br>
                    兒童隱私保護
                    對於兒童使用本公司之本網站、本服務或其他服務時，本公司除依前項保護兒童隱私權外，如有對兒童進行個人或其家庭成員資料之蒐集、使用及向第三者揭露，將依法取得兒童父母或監護人之同意。
                    <br>
                    隱私權保護聲明的修訂
                    本公司將會視需要，修改本聲明，以落實保障您的隱私權之立意。請您不定時參閱本聲明，以瞭解並保障您的權益。
                </p>
            </div>
        </section>
    </main>
    <Footer />
    <BackToTop />
</template>

<script>
    import Header from "@/components/Header.vue";
    import Footer from "@/components/Footer.vue";
    import BackToTop from "@/components/BackToTop.vue";
    import { onMounted } from 'vue';
    export default {
        components: {
            Header,
            Footer,
            BackToTop,
        },
        setup() {
            onMounted(() => {
                AOS.init();
            })
        },

        // Option API
        // data() { return {}; },
        // mounted() {},
        // methods: {},
        // watch: {},
        // unmounted() {},
    };
</script>
